; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph0 - mode
	thermograph1 - mode
	spectrograph7 - mode
	thermograph6 - mode
	spectrograph3 - mode
	spectrograph5 - mode
	spectrograph4 - mode
	image2 - mode
	Star0 - direction
	Star2 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 thermograph6)
	(supports instrument0 spectrograph4)
	(supports instrument0 image2)
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 spectrograph3)
	(supports instrument1 spectrograph5)
	(supports instrument1 spectrograph7)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star14)
)
(:goal (and
	(have_image Star9 spectrograph5)
	(have_image Star9 spectrograph3)
	(have_image Planet10 thermograph6)
	(have_image Planet10 spectrograph3)
	(have_image Planet11 image2)
	(have_image Phenomenon12 spectrograph5)
	(have_image Planet13 spectrograph3)
	(have_image Star14 image2)
))

)

; plan
1. (turn_to satellite0 groundstation1 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (turn_to satellite0 star14 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star14)
   goals met: 0 of 8
5. (take_image satellite0 star14 instrument0 image2)
   added: (have_image star14 image2)
   goals met: 1 of 8
6. (turn_to satellite0 planet11 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 planet11)
   goals met: 1 of 8
7. (take_image satellite0 planet11 instrument0 image2)
   added: (have_image planet11 image2)
   goals met: 2 of 8
8. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   goals met: 2 of 8
9. (take_image satellite0 planet10 instrument0 thermograph6)
   added: (have_image planet10 thermograph6)
   goals met: 3 of 8
10. (turn_to satellite0 groundstation4 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation4)
   goals met: 3 of 8
11. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 8
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 8
13. (calibrate satellite0 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 3 of 8
14. (turn_to satellite0 phenomenon12 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 8
15. (take_image satellite0 phenomenon12 instrument1 spectrograph5)
   added: (have_image phenomenon12 spectrograph5)
   goals met: 4 of 8
16. (turn_to satellite0 planet10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet10)
   goals met: 4 of 8
17. (take_image satellite0 planet10 instrument1 spectrograph3)
   added: (have_image planet10 spectrograph3)
   goals met: 5 of 8
18. (turn_to satellite0 planet13 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet13)
   goals met: 5 of 8
19. (take_image satellite0 planet13 instrument1 spectrograph3)
   added: (have_image planet13 spectrograph3)
   goals met: 6 of 8
20. (turn_to satellite0 star9 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star9)
   goals met: 6 of 8
21. (take_image satellite0 star9 instrument1 spectrograph3)
   added: (have_image star9 spectrograph3)
   goals met: 7 of 8
22. (take_image satellite0 star9 instrument1 spectrograph5)
   added: (have_image star9 spectrograph5)
   goals met: 8 of 8
